let total = 0


if(confirm('Слова інтернет та мережа є синонімами?') == true){
total = total + 0.5
}
if(confirm('Дерева можуть мати синій колір листків?') == false){
    total = total + 0.5
}
if(prompt('Якого кольору є пісок?') == 'Жовтий'){
    total = total + 1
}
let minekraft = prompt("Якого року створений майнкрафт? (Відповідь має бути такою: 2000 або 2000р, або 2000 рік)")
if(minekraft == 2009 || minekraft == '2009р' ||minekraft == '2009 рік'){
    total = total + 1
}
if(confirm('При старості коси можуть посивіти?') == true){
    total = total + 0.5
}
if(confirm('У Губки-Боба будинок у вигляді ананасу?') == true){
    total = total + 0.5
}
let Ukraine = prompt("Якого року Україна стала незалежною?(Відповідь має бути такою: 2000 або 2000р, або 2000 рік)")
if(Ukraine == 1991 ||Ukraine == '1991р' ||Ukraine == '1991 рік'){
    total = total + 3
}
let year = prompt("Який рік на даний момент?(Відповідь має бути такою: 2000 або 2000р, або 2000 рік)")
if(year== 2022 ||year== '2022р' ||year== '2022 рік'){
    total = total + 1
}
if(prompt('Число 25.65 є цілим числом чи дробовим?') == 'Дробовим' || 'дробовим'){
    total = total + 2
}
if(confirm('Вчителя з IT навчання звати Володимир?') == true){
    total = total + 0.5
}
if(confirm('Небо може бути фіолетового кольору?') == false){
    total = total + 0.5
}
let nout = prompt("В якому році створили перший ноутбук?(Відповідь має бути такою: 2000 або 2000р, або 2000 рік)")
if(nout == 1979 ||nout == '1979р' ||nout== '1979 рік'){
    total = total + 1
}
if(total<6){
    alert(`Тест не складено. Ваш результат - ${total} балів`)
}else if(9>=total && total>=6){
    alert(`Тест складено задовільно. Ваш результат - ${total} балів`)
}else if(total>10){
    alert(`Тест складено відмінно. Ваш результат - ${total} балів`)
}